arduino/ArduinoCore-megaavr/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

##############################################################

uno2018.name=Arduino Uno WiFi Rev2

uno2018.vid.0=0x03eb
uno2018.pid.0=0x2145

uno2018.upload.tool=avrdude
uno2018.upload.protocol=xplainedmini_updi
uno2018.upload.maximum_size=49152
uno2018.upload.maximum_data_size=6144
uno2018.upload.speed=115200

uno2018.build.mcu=atmega4809
uno2018.build.f_cpu=16000000L
uno2018.build.board=AVR_UNO_WIFI_REV2
uno2018.build.core=arduino
uno2018.build.variant=uno2018
uno2018.build.extra_flags={build.328emulation} -DMILLIS_USE_TIMERB3
#uno2018.build.extra_flags=-B{runtime.tools.atpack.path}/gcc/dev/{build.mcu}

uno2018.bootloader.tool=avrdude
uno2018.bootloader.file=atmega4809_uart_bl.hex
uno2018.bootloader.SYSCFG0=0xC9
uno2018.bootloader.BOOTEND=0x02
uno2018.fuses.file=fuses_4809.bin

menu.mode=Registers emulation
uno2018.menu.mode.on=ATMEGA328
uno2018.menu.mode.on.build.328emulation=-DUNO_WIFI_REV2_328MODE
uno2018.menu.mode.off=None (ATMEGA4809)
uno2018.menu.mode.off.build.328emulation=

##############################################################

nona4809.name=Arduino NONA 4809

nona4809.vid.0=0x2341
nona4809.pid.0=0x0058

nona4809.upload.tool=avrdude
nona4809.upload.protocol=jtag2updi
nona4809.upload.maximum_size=49152
nona4809.upload.maximum_data_size=6144
nona4809.upload.speed=115200

nona4809.build.mcu=atmega4809
nona4809.build.f_cpu=16000000L
nona4809.build.board=AVR_UNO_WIFI_REV2
nona4809.build.core=arduino
nona4809.build.variant=nona4809
nona4809.build.extra_flags={build.328emulation} -DMILLIS_USE_TIMERB3
#nona4809.build.extra_flags=-B{runtime.tools.atpack.path}/gcc/dev/{build.mcu}

nona4809.bootloader.tool=avrdude
nona4809.bootloader.file=atmega4809_uart_bl.hex
nona4809.bootloader.SYSCFG0=0xC9
nona4809.bootloader.BOOTEND=0x00
nona4809.fuses.file=fuses_4809.bin

menu.mode=Registers emulation
nona4809.menu.mode.on=ATMEGA328
nona4809.menu.mode.on.build.328emulation=-DAVR_NANO_4809_328MODE
nona4809.menu.mode.off=None (ATMEGA4809)
nona4809.menu.mode.off.build.328emulation=

##############################################################
